var local_database = [
  {
    avatar_img: "/images/avatar/1.png",
    title: "胆小的人，注定要失去生命中的精彩与美丽",
    date: "Nov 21 2017",
    post_img: "/images/post/bl.png",
    view: 65,
    collect: 90,
    content: "　离开办公桌，影印一份资料，不过三分钟时间，一只蚂蚁爬上她刚买的黑森林蛋糕。那蛋糕是她的午茶点心，这下享用的兴致全无了。她拿起叉子把蚂蚁取出，然后质问它为什么破坏她的好心情。浑身沾满糖衣的蚂蚁，慢条斯理的回答：\"我饿了，被蛋糕的香味给吸引过来。\"蚂蚁说，它...",
    postId:0,
    headImageSrc:"/images/post/bl.png",
    author: "李安",
    dateTime: "两天前",
    detail: "　离开办公桌，影印一份资料，不过三分钟时间，一只蚂蚁爬上她刚买的黑森林蛋糕。那蛋糕是她的午茶点心，这下享用的兴致全无了。\n　她拿起叉子把蚂蚁取出，然后质问它为什么破坏她的好心情。\n　浑身沾满糖衣的蚂蚁，慢条斯理的回答：\"我饿了，被蛋糕的香味给吸引过来。\"蚂蚁说，它的食量小，吃不了多少，给它一小角蛋糕，就够了。\n　她听了更是火大，不顾形象，指责它：\"你的身份，哪能跟我一起吃相同的东西\？\"她告诉蚂蚁，它应该去找残余的食物，怎么可以堂而皇之与她分食。\n　蚂蚁说：\"我有我的人格，不想卑微讨生活。\"蚂蚁一脸委屈地向她说道，它想出人头地，可是天生的不平等，教它只能不起眼地过日子，可是它不想庸庸碌碌了此一生，所以选择到这陌生且危险的城市。\n　经它这么一说，她突然心软：\"你不怕无法适应\？\"她怀疑。\n　\"做过了，才知道怎么回事。光是害怕，有什么用\！\"蚂蚁又接着说，它不觉得它的人生只有一条路走，它相信，它的生命充满了无限可能。\n　她不发一语，心情顿时复杂。\n　这些年…… \n　她最大的困境，是知道自己要什么，却始终未曾付诸行动，她不懂为何迟疑，或者应该说，她怕改变。然而，胆小的人，注定要失去生命中的种种精彩与美丽。因此，她只能原地打转，也许不会更坏，但也绝对不会更好。\n  回过神，她有了决定，同时准备把整块蛋糕送给蚂蚁。蚂蚁谢绝了她的好意，它说，它已经尝过滋味，想再去试点别的。\n　而她，一个新的生命历程，于焉成形，蓄势待发。\n　胆小的人，注定要失去生命中的精彩与美丽。"
  },
  {
    avatar_img: "/images/avatar/2.png",
    title: "美丽而精致的冰雪大世界",
    date: "Oct 11 2017",
    post_img: "/images/post/cat.png",
    view: 33,
    collect: 43,
    content: "　美丽而精致的冰雪大世界哈尔滨的冰雪大世界非常美丽，是我想往已久的地方，是我流连忘返的地方。一个寒冷的周末，我们全家坐一夜火车专程赶往哈尔滨参观冰雪大世界。带着一路的兴奋我们来到了冰雪大世界的门口，大门是用冰做的，上面刻着八个大字：第八届冰雪...",
    postId: 1,
    headImageSrc: "/images/post/cat.png",
    author: "白岩松",
    dateTime: "一天前",
    detail: "　美丽而精致的冰雪大世界 \n　哈尔滨的冰雪大世界非常美丽，是我想往已久的地方，是我流连忘返的地方。\n　一个寒冷的周末，我们全家坐一夜火车专程赶往哈尔滨参观冰雪大世界。带着一路的兴奋我们来到了冰雪大世界的门口，大门是用冰做的，上面刻着八个大字：第八届冰雪大世界。走进门里，就像来到了童话世界一样…… \n 　这里冰天雪地特别寒冷.我们往右走, 来到了滑雪场, 有许多孩子坐在气垫上往下滑, 非常刺激。再往前走看见了七个小矮人和白雪公主, 小矮人去工作了, 白雪公主正在跳舞, 离近一看, 原来是用雪做的假的呀!真是活灵活现。冰雪大世界很大，有50000多平方米，里面好看好玩的地方有许多，有各种富有梦幻色彩冰灯、冰雕，有小孩子们喜爱的冰滑梯、滑冰橇和抽尜竞技场。\n　我喜欢你冰雪大世界，这里的夜晚太神奇，我喜欢你的美丽和精致，我爱你——冰雪大世界！"
  },
  {
    avatar_img: "/images/avatar/3.png",
    title: "剪短发",
    date: "Dec 20 2017",
    post_img: "/images/post/crab.png",
    view: 25,
    collect: 12,
    content: "　扎辫子可以让女孩显得很可爱。我曾经也有两条小辫子，由于以前扎得太紧，头发容易脱落，慢慢地干燥起来。而且奶奶现在手不好，不方便给我扎头发了。今天，奶奶让我到理发店中把辫子剪掉，剪成短发。理发的还帮我弄了个前流海，我照了一下还蛮可爱。虽然不能...",
    postId: 2,
    headImageSrc: "/images/post/crab.png",
    author: "莫言",
    dateTime: "两天前",
    detail: "　扎辫子可以让女孩显得很可爱。我曾经也有两条小辫子，由于以前扎得太紧，头发容易脱落，慢慢地干燥起来。而且奶奶现在手不好，不方便给我扎头发了。\n　今天，奶奶让我到理发店中把辫子剪掉，剪成短发。理发的还帮我弄了个“前流海”，我照了一下还蛮可爱。\n　虽然不能扎可爱的小辫子了，漂亮的小发圈用不上了，仔细一想短发也有短发的好处。\n　头发要吸收许多营养。以前有个笑话：一位家长想让孩子把头发剪了，说：“头发要吸取许多营养的。”难知孩子却说：“那你不是把‘营养’全剪了！”他的家长哭笑不得。再说现在是夏天，很热的，短发既清爽又方便梳理，也不错哟！"
  },
  {
    avatar_img: "/images/avatar/4.png",
    title: "这么短暂，那么永恒",
    date: "Jan 1 2018",
    post_img: "/images/post/sls.jpg",
    view: 25,
    collect: 23,
    content: "窗外面，悄然无声，月色朦胧。繁星布满银河，好似一颗颗钻石镶在深蓝色的绸子上，闪烁着光芒。几千几万年来，它们一直在自己的位置闪烁，不曾改变。可是我却从未记清具体某颗星的位置，也不知道它的名字、真正面目、来历。它们是那么平凡，闪耀了几千几...",
    postId: 3,
    headImageSrc: "/images/post/sls.jpg",
    author: "冰心",
    dateTime: "三天前",
    detail: "　窗外面，悄然无声，月色朦胧。繁星布满银河，好似一颗颗钻石镶在深蓝色的绸子上，闪烁着光芒。几千几万年来，它们一直在自己的位置闪烁，不曾改变。可是我却从未记清具体某颗星的位置，也不知道它的名字、真正面目、来历。它们是那么平凡，闪耀了几千几万年，却没有让人们记住自己；它们是那么平庸，不肯用自己的寿命来换取瞬间的闪亮，让光芒成为永恒。\n　这时，天边的一道闪亮的银光打断了我的思考。哦！是流星。那银白色的一道亮光从天空划落，瞬间消失不见。似天使的眼泪。划过人间，坠入凡尘，落向大海。几分钟后，我仍然注视着刚才流星划过的方向，心里似惊起波澜，久久未能平静。“这么短暂”，我不仅感叹。可是那个瞬间，那个美丽的画面却定格在心灵的演播室，不断地重复放映。啊，短暂的生命，永恒的美好！\n　这样的想法，似曾相识。我们生活中也有许许多多类似之人或事。他们用短暂的生命，换取了人们永恒的记忆。他们虽身死，但精神永存。那浩然正气将永载史册，那宝贵的精神将被后世发扬光大。还记得任长霞吗？那个为国家利益而殉职的警官，那个为人民服务的好局长。她的生命虽短暂，但精神永恒，人们永不会忘记她的贡献。还记得那个人民的螺丝钉雷锋吗？那个乐于助人的好榜样。他虽然只活了二十七岁，却流芳千古。\n　还有为国献身的黄继光，顾全大局的董存瑞，一心保国的夏完淳……他们是世界最美的昙花，花期那么短暂，香气却那么永恒。"
  },
  {
    avatar_img: "/images/avatar/5.png",
    title: "50米短跑",
    date: "Feb 13 2018",
    post_img: "/images/post/vr.png",
    view: 52,
    collect: 14,
    content: "　50米短跑一听到发令声，就拼命摆臂迈腿的运动是什么？对了，当然是跑步喽！我们暑假一回来上学，第一件事就是体康测试。在四年级体测项目中，有两项是跑步，分别是50米和200米，最激烈的要属50米。50米是一项超短距离运动，最考起跑和爆发力...",
    postId: 4,
    headImageSrc: "/images/post/vr.png",
    author: "史铁生",
    dateTime: "6小时前",
    detail: "　一听到发令声，就拼命摆臂迈腿的运动是什么？对了，当然是跑步喽！\n　我们暑假一回来上学，第一件事就是体康测试。在四年级体测项目中，有两项是跑步，分别是50米和200米，最激烈的要属50米。50米是一项超短距离运动，最考起跑和爆发力，过程中就各显神通了，可以高频率，也可以迈大步。我的长跑虽然也不拔尖，但相比之下，我的长跑比短跑还强一些，这让我经常为短跑而苦恼。好好练了几天，我好像摸到了一点儿门道：一听到发令声立刻就跑，毫不犹豫地跑跑跑；眼睛呢，必须看到60米开外，这样才能在接近终点时也不减速，全速跑过终点，取得一个好成绩。\n　通过观察和比较，我还发现，在与同学一争高下时，或在测试时，我和同学们，往往都很有冲劲，人人都好像在腿上装了个小马达似的，成绩能比原来提高不少。由此可见，不管做什么事，认真对待是最重要的，当然，还有一股拼劲！\n　看吧，如果每项体测都像我这样认真练习，仔细钻研、分析，那么就一点儿都不用为测试和突击检查担心了。"
  }
];

//定义出口，类似Node.js
module.exports = {
  postList: local_database
};